jbriceno225/3-Axis-Holonomic-Drive-Robot/ESP32_Code/Kiwi_Drive_Kin_ROS2_Velocity_PID_Bluepad32.ino
#include <Bluepad32.h>
#include <esp_arduino_version.h>
#include <math.h>



// ---------------------------------------------------------------------------------------------------------------------------
// Bluepad32 controllers
// ---------------------------------------------------------------------------------------------------------------------------

ControllerPtr myControllers[BP32_MAX_GAMEPADS];





// ---------------------------------------------------------------------------------------------------------------------------
// ESP32 pin assignments
// ---------------------------------------------------------------------------------------------------------------------------

// Shared TB6612FNG standby pin
const uint8_t STBY = 19;

// ---------------- Motor 1 ----------------
const uint8_t M1_PWM = 25;
const uint8_t M1_IN1 = 26;
const uint8_t M1_IN2 = 27;
    //------------- Motor 1 Encoder --------
const uint8_t M1_ENCA = 34;
const uint8_t M1_ENCB = 35;

// ---------------- Motor 2 ----------------
const uint8_t M2_PWM = 13;
const uint8_t M2_IN1 = 12;
const uint8_t M2_IN2 = 14;

    //------------- Motor 1 Encoder --------
    // VP = GPIO36
    // VN = GPIO39
const uint8_t M2_ENCA = 36;
const uint8_t M2_ENCB = 39;

// ---------------- Motor 3 ----------------

const uint8_t M3_PWM = 32;
const uint8_t M3_IN1 = 33;
const uint8_t M3_IN2 = 23;

    //------------- Motor 1 Encoder --------
    // RX2 = GPIO16
    // TX2 = GPIO17
const uint8_t M3_ENCA = 16;
const uint8_t M3_ENCB = 17;





// ---------------------------------------------------------------------------------------------------------------------------
// PWM configuration
// ---------------------------------------------------------------------------------------------------------------------------

const uint32_t PWM_FREQUENCY_HZ = 20000;
const uint8_t PWM_RESOLUTION_BITS = 8;

// Used by ESP32 Arduino Core 2.x
const uint8_t M1_PWM_CHANNEL = 0;
const uint8_t M2_PWM_CHANNEL = 1;
const uint8_t M3_PWM_CHANNEL = 2;





// ---------------------------------------------------------------------------------------------------------------------------
// Controller configuration
// ---------------------------------------------------------------------------------------------------------------------------

// Bluepad32 joystick values are approximately -512 to +512.
const int AXIS_MAX = 512;

const int LEFT_STICK_DEADZONE = 80;
const int RIGHT_STICK_DEADZONE = 30;

// Maximum PWM the speed controller may command.
const int MAX_PWM = 240;

// Disabled: a hard PWM floor destroys the relative wheel-speed ratios
// required for low-speed holonomic motion. Characterize compensation first.
const int MIN_PWM = 0;

// Overall joystick sensitivity.
const float TRANSLATION_SCALE = 1.00f;
const float ROTATION_SCALE = 0.80f;

// Positive logical wheel command to physical motor direction.
const int M1_DIRECTION = 1;
const int M2_DIRECTION = 1;
const int M3_DIRECTION = 1;

// Serial diagnostic interval. (Set to 100ms so it wont spam the serial).
const unsigned long PRINT_INTERVAL_MS = 100;
unsigned long lastPrintTime = 0;





// ---------------------------------------------------------------------------------------------------------------------------
// Encoder and velocity-control configuration
// ---------------------------------------------------------------------------------------------------------------------------

// Confirmed using full x4 quadrature decoding.
const float COUNTS_PER_REVOLUTION = 1976.1f;

// ROS / odometry telemetry interval (20 Hz or ever 50ms).
const unsigned long ODOM_TELEMETRY_INTERVAL_MS = 50;
unsigned long lastOdomTelemetryTime = 0;

// Leave control headroom below the nominal 130 RPM no-load speed.
// (after watching video this is important for autonomous control because it leaves headroom to allow the robot to speed up if detecting an error if needed to).
const float MAX_TARGET_RPM = 120.0f;

// Velocity loop at 50 Hz. (20ms) (50x per sec).
const uint32_t PID_PERIOD_US = 20000;

// Positive motor command produced negative raw encoder counts in
// the Motor 3 position test. Since all three encoders are wired
// identically I simply inverted all 3 for ideal operation.
const int ENCODER_DIRECTION[3] = {-1, -1, -1};

// Starting PID gains.
float velocityKp[3] = {0.80f, 0.80f, 0.80f};
float velocityKi[3] = {0.30f, 0.30f, 0.30f};
float velocityKd[3] = {0.05f, 0.05f, 0.05f};

// RPM first order low-pass filter: 0 = no new data, 1 = no filtering. ( RPMfilt = alpha * RPMnew + (1 - alpha)RPMold )
const float RPM_FILTER_ALPHA = 0.30f;

// Stop tiny target commands.
const float TARGET_RPM_DEADBAND = 1.0f;

// Integral anti-windup limit. (I == I + e * delta_t) this is very important for making if a wheel is stuck
// and commands to that wheel want a specific rpm this will prevent the error integral from shooting up (limits to -100 <-> 100)
const float INTEGRAL_LIMIT = 100.0f;





// ---------------------------------------------------------------------------------------------------------------------------
// Manual / autonomous mode configuration
// ---------------------------------------------------------------------------------------------------------------------------


// Manual is for using the bluetooth controller (xbox) and autonomous is for ROS2 and Nav2 control thru the pi
enum class ControlMode {
  MANUAL,
  AUTONOMOUS
};

// Starts the controller in manual, will update to autonomous if wanting to start off in self nav
ControlMode controlMode = ControlMode::MANUAL;

// Xbox Start button misc bit.
const uint8_t START_MISC_MASK = 0x04;

// Stop the robot if the Pi stops refreshing autonomous commands. So if ROS2 crashes which did happen a couple times this will stop
// the robot rather than continuing indefinetly 
const unsigned long AUTO_COMMAND_TIMEOUT_MS = 300;

String serialCommandBuffer;
unsigned long lastAutoCommandTimeMs = 0; // storing the last autonomous command
bool autoTimeoutActive = false;          // if timeout occurs this will flip so rather than repeating the timeout error indefinetly it does it once
bool startButtonWasPressed = false;      





// ---------------------------------------------------------------------------------------------------------------------------
// Runtime state
// ---------------------------------------------------------------------------------------------------------------------------

//  actual pwm output calculated by controller (not the targeted RPM or measured RPM)
int motor1Command = 0;
int motor2Command = 0;
int motor3Command = 0;

//  Linked this to A so pressing A will cause the software motor switch, to switch back pressing B can be pressed
bool emergencyStopActive = false;

