jbriceno225/3-Axis-Holonomic-Drive-Robot/ESP32_Code/Kiwi_Drive_Kin_ROS2_Velocity_PID_Bluepad32.ino
// Encoder state.
volatile int32_t encoderCount[3] = {0, 0, 0};
volatile uint8_t previousEncoderState[3] = {0, 0, 0};

// Quadrature lookup table in RAM for ISR use.
DRAM_ATTR const int8_t QUADRATURE_TABLE[16] = {
   0, -1,  1,  0,
   1,  0,  0, -1,
  -1,  0,  0,  1,
   0,  1, -1,  0
};

portMUX_TYPE encoderMux = portMUX_INITIALIZER_UNLOCKED;

// Velocity controller state.
int32_t previousPIDEncoderCount[3] = {0, 0, 0};

float targetRPM[3] = {0.0f, 0.0f, 0.0f};
float measuredRPM[3] = {0.0f, 0.0f, 0.0f};
float rawRPM[3] = {0.0f, 0.0f, 0.0f};

float velocityIntegral[3] = {0.0f, 0.0f, 0.0f};
float previousVelocityError[3] = {0.0f, 0.0f, 0.0f};

// Last command actually applied to each H-bridge. This is emitted in the
// low-rate diagnostic record so calibration uses measured, rather than
// inferred, PID output.
int appliedPWM[3] = {0, 0, 0};

uint32_t previousPIDTimeUs = 0;





// ---------------------------------------------------------------------------------------------------------------------------
// Function declarations
// ---------------------------------------------------------------------------------------------------------------------------

void stopAllMotors();
void enableMotorDrivers();
void disableMotorDrivers();

void configurePWM();
void writeMotorPWM(uint8_t pwmPin, uint8_t channel, int duty);

void setMotor(
  uint8_t pwmPin,
  uint8_t pwmChannel,
  uint8_t in1Pin,
  uint8_t in2Pin,
  int speed
);

void resetVelocityController();
void driveKiwi(float x, float y, float rotation);
void runVelocityPID();

void processSerialCommands();
void processCompleteSerialCommand(String command);
void setControlMode(ControlMode newMode, const char* source);
void checkAutonomousTimeout();
const char* controlModeName();

void processControllers();
void processGamepad(ControllerPtr ctl);
void printControllerData(
  ControllerPtr ctl,
  int rawLX,
  int rawLY,
  int rawRX,
  float x,
  float y,
  float rotation
);

void sendOdometryTelemetry();

void IRAM_ATTR motor1EncoderISR();
void IRAM_ATTR motor2EncoderISR();
void IRAM_ATTR motor3EncoderISR();





// ---------------------------------------------------------------------------------------------------------------------------
// Bluepad32 callbacks
// ---------------------------------------------------------------------------------------------------------------------------

void onConnectedController(ControllerPtr ctl) {
  for (int i = 0; i < BP32_MAX_GAMEPADS; i++) {
    if (myControllers[i] == nullptr) {
      myControllers[i] = ctl;

      ControllerProperties properties = ctl->getProperties();

      Serial.println();
      Serial.println("=================================");
      Serial.printf("CONTROLLER CONNECTED: slot %d\n", i);
      Serial.printf("Model: %s\n", ctl->getModelName().c_str());
      Serial.printf(
        "VID: 0x%04X  PID: 0x%04X\n",
        properties.vendor_id,
        properties.product_id
      );
      Serial.println("=================================");

      emergencyStopActive = false;
      stopAllMotors();
      enableMotorDrivers();
      return;
    }
  }

  Serial.println(
    "Controller connected, but no controller slot was available."
  );
}

void onDisconnectedController(ControllerPtr ctl) {
  for (int i = 0; i < BP32_MAX_GAMEPADS; i++) {
    if (myControllers[i] == ctl) {
      myControllers[i] = nullptr;

      Serial.println();
      Serial.printf(
        "CONTROLLER DISCONNECTED: slot %d\n",
        i
      );

      startButtonWasPressed = false;
      stopAllMotors();
      disableMotorDrivers();
      return;
    }
  }
}





// ---------------------------------------------------------------------------------------------------------------------------
// PWM functions
// ---------------------------------------------------------------------------------------------------------------------------

void configurePWM() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3

  bool motor1Attached = ledcAttach(
    M1_PWM,
    PWM_FREQUENCY_HZ,
    PWM_RESOLUTION_BITS
  );

  bool motor2Attached = ledcAttach(
    M2_PWM,
    PWM_FREQUENCY_HZ,
    PWM_RESOLUTION_BITS
  );

  bool motor3Attached = ledcAttach(
    M3_PWM,
    PWM_FREQUENCY_HZ,
    PWM_RESOLUTION_BITS
  );

#else

  ledcSetup(
    M1_PWM_CHANNEL,
    PWM_FREQUENCY_HZ,
    PWM_RESOLUTION_BITS
  );

  ledcSetup(
    M2_PWM_CHANNEL,
    PWM_FREQUENCY_HZ,
    PWM_RESOLUTION_BITS
  );

  ledcSetup(
    M3_PWM_CHANNEL,
    PWM_FREQUENCY_HZ,
    PWM_RESOLUTION_BITS
  );

  ledcAttachPin(M1_PWM, M1_PWM_CHANNEL);
  ledcAttachPin(M2_PWM, M2_PWM_CHANNEL);
  ledcAttachPin(M3_PWM, M3_PWM_CHANNEL);

  bool motor1Attached = true;
  bool motor2Attached = true;
  bool motor3Attached = true;

#endif

  if (!motor1Attached ||
      !motor2Attached ||
      !motor3Attached) {
    Serial.println(
      "ERROR: One or more PWM pins failed to attach."
    );
  } else {
    Serial.printf(
      "PWM configured: %lu Hz, %u-bit\n",
      PWM_FREQUENCY_HZ,
      PWM_RESOLUTION_BITS
    );
  }
}

void writeMotorPWM(
  uint8_t pwmPin,
  uint8_t channel,
  int duty
) {
  duty = constrain(duty, 0, 255);

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(pwmPin, duty);
#else
  ledcWrite(channel, duty);
#endif
}





// ---------------------------------------------------------------------------------------------------------------------------
// Motor-driver control
// ---------------------------------------------------------------------------------------------------------------------------

void enableMotorDrivers() {
  digitalWrite(STBY, HIGH);
}

void disableMotorDrivers() {
  digitalWrite(STBY, LOW);
}

void setMotor(
  uint8_t pwmPin,
  uint8_t pwmChannel,
  uint8_t in1Pin,
  uint8_t in2Pin,
  int speed
) {
  speed = constrain(speed, -255, 255);

  if (speed > 0) {
    digitalWrite(in1Pin, HIGH);
    digitalWrite(in2Pin, LOW);
    writeMotorPWM(pwmPin, pwmChannel, speed);
  } else if (speed < 0) {
    digitalWrite(in1Pin, LOW);
    digitalWrite(in2Pin, HIGH);
    writeMotorPWM(pwmPin, pwmChannel, -speed);
  } else {
    writeMotorPWM(pwmPin, pwmChannel, 0);

