jbriceno225/3-Axis-Holonomic-Drive-Robot/ESP32_Code/Kiwi_Drive_Kin_ROS2_Velocity_PID_Bluepad32.ino
    // Coast mode.
    digitalWrite(in1Pin, LOW);
    digitalWrite(in2Pin, LOW);
  }
}

void resetVelocityController() {
  portENTER_CRITICAL(&encoderMux);
  previousPIDEncoderCount[0] = encoderCount[0];
  previousPIDEncoderCount[1] = encoderCount[1];
  previousPIDEncoderCount[2] = encoderCount[2];
  portEXIT_CRITICAL(&encoderMux);

  for (int i = 0; i < 3; i++) {
    targetRPM[i] = 0.0f;
    rawRPM[i] = 0.0f;
    measuredRPM[i] = 0.0f;
    velocityIntegral[i] = 0.0f;
    previousVelocityError[i] = 0.0f;
  }

  previousPIDTimeUs = micros();
}

void stopAllMotors() {
  targetRPM[0] = 0.0f;
  targetRPM[1] = 0.0f;
  targetRPM[2] = 0.0f;

  velocityIntegral[0] = 0.0f;
  velocityIntegral[1] = 0.0f;
  velocityIntegral[2] = 0.0f;

  previousVelocityError[0] = 0.0f;
  previousVelocityError[1] = 0.0f;
  previousVelocityError[2] = 0.0f;

  motor1Command = 0;
  motor2Command = 0;
  motor3Command = 0;

  setMotor(
    M1_PWM,
    M1_PWM_CHANNEL,
    M1_IN1,
    M1_IN2,
    0
  );

  setMotor(
    M2_PWM,
    M2_PWM_CHANNEL,
    M2_IN1,
    M2_IN2,
    0
  );

  setMotor(
    M3_PWM,
    M3_PWM_CHANNEL,
    M3_IN1,
    M3_IN2,
    0
  );
}





// ---------------------------------------------------------------------------------------------------------------------------
// Encoder interrupts
// ---------------------------------------------------------------------------------------------------------------------------

void IRAM_ATTR updateEncoderFromISR(
  uint8_t motorIndex,
  uint8_t pinA,
  uint8_t pinB
) {
  const uint8_t a = digitalRead(pinA);
  const uint8_t b = digitalRead(pinB);
  const uint8_t currentState = (a << 1) | b;

  portENTER_CRITICAL_ISR(&encoderMux);

  const uint8_t tableIndex =
    (previousEncoderState[motorIndex] << 2) |
    currentState;

  encoderCount[motorIndex] +=
    ENCODER_DIRECTION[motorIndex] *
    QUADRATURE_TABLE[tableIndex];

  previousEncoderState[motorIndex] = currentState;

  portEXIT_CRITICAL_ISR(&encoderMux);
}

void IRAM_ATTR motor1EncoderISR() {
  updateEncoderFromISR(0, M1_ENCA, M1_ENCB);
}

void IRAM_ATTR motor2EncoderISR() {
  updateEncoderFromISR(1, M2_ENCA, M2_ENCB);
}

void IRAM_ATTR motor3EncoderISR() {
  updateEncoderFromISR(2, M3_ENCA, M3_ENCB);
}





// ---------------------------------------------------------------------------------------------------------------------------
// Input-processing functions
// ---------------------------------------------------------------------------------------------------------------------------

float normalizeAxisWithDeadzone(
  int rawValue,
  int deadzone
) {
  int magnitude = abs(rawValue);

  if (magnitude <= deadzone) {
    return 0.0f;
  }

  float normalizedMagnitude =
    static_cast<float>(magnitude - deadzone) /
    static_cast<float>(AXIS_MAX - deadzone);

  normalizedMagnitude = constrain(
    normalizedMagnitude,
    0.0f,
    1.0f
  );

  return rawValue < 0
           ? -normalizedMagnitude
           : normalizedMagnitude;
}





// ---------------------------------------------------------------------------------------------------------------------------
// Kiwi-drive calculations
// ---------------------------------------------------------------------------------------------------------------------------

void driveKiwi(
  float x,
  float y,
  float rotation
) {
  const float SIN_60 = 0.8660254f;

  x *= TRANSLATION_SCALE;
  y *= TRANSLATION_SCALE;
  rotation *= ROTATION_SCALE;

  /*
            FRONT OF ROBOT
                ^

        Motor 1       Motor 3
             \         /
              \       /
                Motor 2

                  BACK

    x: positive = robot right
    y: positive = robot forward
  */

  float wheel1 =
    (-0.5f * x) +
    (SIN_60 * y) +
    rotation;

  float wheel2 =
      x +
      rotation;

  float wheel3 =
      (-0.5f * x) -
      (SIN_60 * y) +
      rotation;

  // Preserve wheel ratios while limiting every command to +/-1.
  float largest = fabsf(wheel1);

  if (fabsf(wheel2) > largest) {
    largest = fabsf(wheel2);
  }

  if (fabsf(wheel3) > largest) {
    largest = fabsf(wheel3);
  }

  if (largest > 1.0f) {
    wheel1 /= largest;
    wheel2 /= largest;
    wheel3 /= largest;
  }

  // Create target RPM instead of direct PWM.
  targetRPM[0] =
    wheel1 * MAX_TARGET_RPM * M1_DIRECTION;

  targetRPM[1] =
    wheel2 * MAX_TARGET_RPM * M2_DIRECTION;

  targetRPM[2] =
    wheel3 * MAX_TARGET_RPM * M3_DIRECTION;

  for (int i = 0; i < 3; i++) {
    if (fabsf(targetRPM[i]) < TARGET_RPM_DEADBAND) {
      targetRPM[i] = 0.0f;
    }
  }
}





// ---------------------------------------------------------------------------------------------------------------------------
// Velocity PID
// ---------------------------------------------------------------------------------------------------------------------------

void applyMotorCommand(uint8_t motorIndex, int command) {
  appliedPWM[motorIndex] = command;

  switch (motorIndex) {
    case 0:
      motor1Command = command;
      setMotor(
        M1_PWM,
        M1_PWM_CHANNEL,
        M1_IN1,
        M1_IN2,
        motor1Command
      );
      break;

    case 1:
      motor2Command = command;
      setMotor(
        M2_PWM,
        M2_PWM_CHANNEL,
        M2_IN1,
        M2_IN2,
        motor2Command
      );
      break;

    case 2:
      motor3Command = command;
      setMotor(
        M3_PWM,
        M3_PWM_CHANNEL,
        M3_IN1,
        M3_IN2,
        motor3Command
      );
      break;
  }
}

void runVelocityPID() {
  const uint32_t currentTimeUs = micros();

  if (
    static_cast<uint32_t>(
      currentTimeUs - previousPIDTimeUs
    ) < PID_PERIOD_US
  ) {
    return;
  }

  const float dt =
    static_cast<float>(
      static_cast<uint32_t>(
        currentTimeUs - previousPIDTimeUs
      )
    ) / 1000000.0f;

  previousPIDTimeUs = currentTimeUs;

  // Reject unreasonable timing intervals.
  if (dt <= 0.0f || dt > 0.25f) {
    resetVelocityController();
    return;
  }

  int32_t currentCounts[3];

  portENTER_CRITICAL(&encoderMux);
  currentCounts[0] = encoderCount[0];
  currentCounts[1] = encoderCount[1];
  currentCounts[2] = encoderCount[2];
  portEXIT_CRITICAL(&encoderMux);

  for (uint8_t i = 0; i < 3; i++) {
    const int32_t deltaCounts =
      currentCounts[i] -
      previousPIDEncoderCount[i];

    previousPIDEncoderCount[i] =
      currentCounts[i];

    rawRPM[i] =
      (
        static_cast<float>(deltaCounts) /
        COUNTS_PER_REVOLUTION
      ) *
      (60.0f / dt);

    measuredRPM[i] =
      RPM_FILTER_ALPHA * rawRPM[i] +
      (1.0f - RPM_FILTER_ALPHA) * measuredRPM[i];

    if (
      emergencyStopActive ||
      fabsf(targetRPM[i]) <
        TARGET_RPM_DEADBAND
    ) {
      velocityIntegral[i] = 0.0f;
      previousVelocityError[i] = 0.0f;
      applyMotorCommand(i, 0);
      continue;
    }

