jbriceno225/3-Axis-Holonomic-Drive-Robot/ESP32_Code/Kiwi_Drive_Kin_ROS2_Velocity_PID_Bluepad32.ino
    const float error =
      targetRPM[i] - measuredRPM[i];

    velocityIntegral[i] += error * dt;

    velocityIntegral[i] = constrain(
      velocityIntegral[i],
      -INTEGRAL_LIMIT,
      INTEGRAL_LIMIT
    );

    const float derivative =
      (error - previousVelocityError[i]) / dt;

    previousVelocityError[i] = error;

    /*
      Feed-forward supplies most of the expected PWM.
      PID corrects motor mismatch, load, friction, and
      battery-voltage changes.
    */
    const float feedForward =
      (targetRPM[i] / MAX_TARGET_RPM) *
      static_cast<float>(MAX_PWM);

    const float correction =
      velocityKp[i] * error +
      velocityKi[i] * velocityIntegral[i] +
      velocityKd[i] * derivative;

    float pwmOutput =
      feedForward + correction;

    pwmOutput = constrain(
      pwmOutput,
      -static_cast<float>(MAX_PWM),
      static_cast<float>(MAX_PWM)
    );

    // Overcome static friction without changing direction.
    if (
      pwmOutput > 0.0f &&
      pwmOutput < static_cast<float>(MIN_PWM)
    ) {
      pwmOutput = static_cast<float>(MIN_PWM);
    } else if (
      pwmOutput < 0.0f &&
      pwmOutput > -static_cast<float>(MIN_PWM)
    ) {
      pwmOutput = -static_cast<float>(MIN_PWM);
    }

    applyMotorCommand(
      i,
      static_cast<int>(roundf(pwmOutput))
    );
  }
}





// ---------------------------------------------------------------------------------------------------------------------------
// Manual / autonomous mode and serial commands
// ---------------------------------------------------------------------------------------------------------------------------

const char* controlModeName() {
  return controlMode == ControlMode::MANUAL
           ? "MANUAL"
           : "AUTO";
}

void setControlMode(
  ControlMode newMode,
  const char* source
) {
  if (controlMode == newMode) {
    return;
  }

  stopAllMotors();
  resetVelocityController();

  controlMode = newMode;
  autoTimeoutActive = false;

  if (
    controlMode == ControlMode::AUTONOMOUS
  ) {
    lastAutoCommandTimeMs = millis();
  }

  if (!emergencyStopActive) {
    enableMotorDrivers();
  }

  Serial.printf(
    "MODE,%s,SOURCE,%s\n",
    controlModeName(),
    source
  );
}

void processCompleteSerialCommand(String command) {
  command.trim();

  if (command.length() == 0) {
    return;
  }

  if (command.equalsIgnoreCase("MODE,AUTO")) {
    setControlMode(
      ControlMode::AUTONOMOUS,
      "SERIAL"
    );

    Serial.println("ACK,MODE,AUTO");
    lastAutoCommandTimeMs = millis();
    autoTimeoutActive = false;
    return;
  }

  if (command.equalsIgnoreCase("MODE,MANUAL")) {
    setControlMode(
      ControlMode::MANUAL,
      "SERIAL"
    );

    Serial.println("ACK,MODE,MANUAL");
    return;
  }

  if (command.equalsIgnoreCase("STOP")) {
    stopAllMotors();
    Serial.println("ACK,STOP");
    return;
  }

  if (command.equalsIgnoreCase("PING")) {
    Serial.println("ACK,PONG");
    return;
  }

  float x = 0.0f;
  float y = 0.0f;
  float rotation = 0.0f;

  const int parsed = sscanf(
    command.c_str(),
    "V,%f,%f,%f",
    &x,
    &y,
    &rotation
  );

  if (parsed == 3) {
    if (
      controlMode !=
      ControlMode::AUTONOMOUS
    ) {
      Serial.println("ERR,NOT_IN_AUTO_MODE");
      return;
    }

    if (emergencyStopActive) {
      stopAllMotors();
      Serial.println("ERR,ESTOP_ACTIVE");
      return;
    }

    x = constrain(x, -1.0f, 1.0f);
    y = constrain(y, -1.0f, 1.0f);
    rotation = constrain(
      rotation,
      -1.0f,
      1.0f
    );

    enableMotorDrivers();
    driveKiwi(x, y, rotation);

    lastAutoCommandTimeMs = millis();
    autoTimeoutActive = false;

    Serial.printf(
      "ACK,V,%.4f,%.4f,%.4f\n",
      x,
      y,
      rotation
    );
    return;
  }

  Serial.print("ERR,UNKNOWN_COMMAND,");
  Serial.println(command);
}

void processSerialCommands() {
  while (Serial.available() > 0) {
    const char incoming =
      static_cast<char>(Serial.read());

    if (incoming == '\r') {
      continue;
    }

    if (incoming == '\n') {
      processCompleteSerialCommand(
        serialCommandBuffer
      );

      serialCommandBuffer = "";
      continue;
    }

    if (serialCommandBuffer.length() < 96) {
      serialCommandBuffer += incoming;
    } else {
      serialCommandBuffer = "";
      Serial.println("ERR,COMMAND_TOO_LONG");
    }
  }
}

void checkAutonomousTimeout() {
  if (
    controlMode != ControlMode::AUTONOMOUS
  ) {
    return;
  }

  if (
    millis() - lastAutoCommandTimeMs <=
    AUTO_COMMAND_TIMEOUT_MS
  ) {
    return;
  }

  stopAllMotors();

  if (!autoTimeoutActive) {
    autoTimeoutActive = true;
    Serial.println("WARN,AUTO_COMMAND_TIMEOUT");
  }
}





// ---------------------------------------------------------------------------------------------------------------------------
// Serial diagnostics
// ---------------------------------------------------------------------------------------------------------------------------

void printControllerData(
  ControllerPtr ctl,
  int rawLX,
  int rawLY,
  int rawRX,
  float x,
  float y,
  float rotation
) {
  const unsigned long currentTime = millis();

  if (
    currentTime - lastPrintTime <
    PRINT_INTERVAL_MS
  ) {
    return;
  }

  lastPrintTime = currentTime;

  Serial.printf(
    "LX:%4d LY:%4d RX:%4d  "
    "X:%+.2f Y:%+.2f ROT:%+.2f  "
    "T_RPM[%+.1f,%+.1f,%+.1f]  "
    "M_RPM[%+.1f,%+.1f,%+.1f]  "
    "PWM[%4d,%4d,%4d]  "
    "ENC[%ld,%ld,%ld]  "
    "MODE:%s  ESTOP:%s\n",

    rawLX,
    rawLY,
    rawRX,

    x,
    y,
    rotation,

    targetRPM[0],
    targetRPM[1],
    targetRPM[2],

    measuredRPM[0],
    measuredRPM[1],
    measuredRPM[2],

    motor1Command,
    motor2Command,
    motor3Command,

    static_cast<long>(encoderCount[0]),
    static_cast<long>(encoderCount[1]),
    static_cast<long>(encoderCount[2]),

    controlModeName(),
    emergencyStopActive ? "YES" : "NO"
  );
}





// ---------------------------------------------------------------------------------------------------------------------------
// Gamepad processing
// ---------------------------------------------------------------------------------------------------------------------------

