jbriceno225/3-Axis-Holonomic-Drive-Robot/ESP32_Code/Kiwi_Drive_Kin_ROS2_Velocity_PID_Bluepad32.ino
void processGamepad(ControllerPtr ctl) {
  const int rawLeftX = ctl->axisX();
  const int rawLeftY = ctl->axisY();
  const int rawRightX = ctl->axisRX();

  const float leftX =
    normalizeAxisWithDeadzone(
      rawLeftX,
      LEFT_STICK_DEADZONE
    );

  const float leftY =
    normalizeAxisWithDeadzone(
      rawLeftY,
      LEFT_STICK_DEADZONE
    );

  const float rightX =
    normalizeAxisWithDeadzone(
      rawRightX,
      RIGHT_STICK_DEADZONE
    );

  const float x = -leftX;
  const float y = -leftY;
  const float rotation = rightX;

  // Start toggles MANUAL / AUTO on the press edge.
  const bool startPressed =
    (ctl->miscButtons() & START_MISC_MASK) != 0;

  if (
    startPressed &&
    !startButtonWasPressed
  ) {
    if (
      controlMode == ControlMode::MANUAL
    ) {
      setControlMode(
        ControlMode::AUTONOMOUS,
        "START_BUTTON"
      );
    } else {
      setControlMode(
        ControlMode::MANUAL,
        "START_BUTTON"
      );
    }
  }

  startButtonWasPressed = startPressed;

  // A button latches the emergency stop in either mode.
  if (ctl->a()) {
    emergencyStopActive = true;
    stopAllMotors();
    disableMotorDrivers();
  }

  // B clears emergency stop in either mode.
  if (ctl->b() && emergencyStopActive) {
    emergencyStopActive = false;

    stopAllMotors();
    resetVelocityController();
    enableMotorDrivers();

    if (
      controlMode == ControlMode::AUTONOMOUS
    ) {
      lastAutoCommandTimeMs = millis();
    }

    Serial.println("ACK,ESTOP,CLEARED");
  }

  if (emergencyStopActive) {
    stopAllMotors();

    printControllerData(
      ctl,
      rawLeftX,
      rawLeftY,
      rawRightX,
      x,
      y,
      rotation
    );
    return;
  }

  // In AUTO, controller buttons still work, but joystick
  // motion is ignored. The Pi supplies V,x,y,rotation.
  if (
    controlMode == ControlMode::AUTONOMOUS
  ) {
    printControllerData(
      ctl,
      rawLeftX,
      rawLeftY,
      rawRightX,
      0.0f,
      0.0f,
      0.0f
    );
    return;
  }

  // Manual joystick mode.
  if (
    x == 0.0f &&
    y == 0.0f &&
    rotation == 0.0f
  ) {
    stopAllMotors();

    printControllerData(
      ctl,
      rawLeftX,
      rawLeftY,
      rawRightX,
      0.0f,
      0.0f,
      0.0f
    );
    return;
  }

  enableMotorDrivers();
  driveKiwi(x, y, rotation);

  printControllerData(
    ctl,
    rawLeftX,
    rawLeftY,
    rawRightX,
    x,
    y,
    rotation
  );
}

void processControllers() {
  for (ControllerPtr ctl : myControllers) {
    if (
      ctl != nullptr &&
      ctl->isConnected() &&
      ctl->hasData() &&
      ctl->isGamepad()
    ) {
      processGamepad(ctl);
    }
  }
}





// ---------------------------------------------------------------------------------------------------------------------------
// ROS / odometry telemetry
// ---------------------------------------------------------------------------------------------------------------------------

void sendOdometryTelemetry() {
  static uint8_t diagnosticDivider = 0;

  const unsigned long now = millis();

  if (
    now - lastOdomTelemetryTime <
    ODOM_TELEMETRY_INTERVAL_MS
  ) {
    return;
  }

  lastOdomTelemetryTime = now;

  int32_t count1;
  int32_t count2;
  int32_t count3;

  portENTER_CRITICAL(&encoderMux);

  count1 = encoderCount[0];
  count2 = encoderCount[1];
  count3 = encoderCount[2];

  portEXIT_CRITICAL(&encoderMux);

  Serial.printf(
    "ODOM,%.4f,%.4f,%.4f,%ld,%ld,%ld\n",
    measuredRPM[0],
    measuredRPM[1],
    measuredRPM[2],
    static_cast<long>(count1),
    static_cast<long>(count2),
    static_cast<long>(count3)
  );

  // One diagnostic record per second. ODOM remains unchanged at 20 Hz so the
  // ROS bridge continues to receive its established wire format.
  diagnosticDivider++;
  if (diagnosticDivider >= 20) {
    diagnosticDivider = 0;
    Serial.printf(
      "PID,%.4f,%.4f,%.4f,%d,%.4f,%.4f,%.4f,%d,%.4f,%.4f,%.4f,%d\n",
      targetRPM[0], measuredRPM[0],
      targetRPM[0] - measuredRPM[0], appliedPWM[0],
      targetRPM[1], measuredRPM[1],
      targetRPM[1] - measuredRPM[1], appliedPWM[1],
      targetRPM[2], measuredRPM[2],
      targetRPM[2] - measuredRPM[2], appliedPWM[2]
    );
  }
}





// ---------------------------------------------------------------------------------------------------------------------------
// Setup
// ---------------------------------------------------------------------------------------------------------------------------

void setup() {
  Serial.begin(115200);
  delay(1000);

  Serial.println();
  Serial.println("======================================");
  Serial.println("Starting Kiwi Drive Velocity PID");
  Serial.println("======================================");

  pinMode(STBY, OUTPUT);
  disableMotorDrivers();

  pinMode(M1_IN1, OUTPUT);
  pinMode(M1_IN2, OUTPUT);

  pinMode(M2_IN1, OUTPUT);
  pinMode(M2_IN2, OUTPUT);

  pinMode(M3_IN1, OUTPUT);
  pinMode(M3_IN2, OUTPUT);

  /*
    GPIO34, GPIO35, GPIO36, and GPIO39 do not have
    internal pull-up or pull-down resistors.
  */
  pinMode(M1_ENCA, INPUT);
  pinMode(M1_ENCB, INPUT);

  pinMode(M2_ENCA, INPUT);
  pinMode(M2_ENCB, INPUT);

  pinMode(M3_ENCA, INPUT);
  pinMode(M3_ENCB, INPUT);

  previousEncoderState[0] =
    (digitalRead(M1_ENCA) << 1) |
    digitalRead(M1_ENCB);

  previousEncoderState[1] =
    (digitalRead(M2_ENCA) << 1) |
    digitalRead(M2_ENCB);

  previousEncoderState[2] =
    (digitalRead(M3_ENCA) << 1) |
    digitalRead(M3_ENCB);

  attachInterrupt(
    digitalPinToInterrupt(M1_ENCA),
    motor1EncoderISR,
    CHANGE
  );

  attachInterrupt(
    digitalPinToInterrupt(M1_ENCB),
    motor1EncoderISR,
    CHANGE
  );

  attachInterrupt(
    digitalPinToInterrupt(M2_ENCA),
    motor2EncoderISR,
    CHANGE
  );

  attachInterrupt(
    digitalPinToInterrupt(M2_ENCB),
    motor2EncoderISR,
    CHANGE
  );

  attachInterrupt(
    digitalPinToInterrupt(M3_ENCA),
    motor3EncoderISR,
    CHANGE
  );

  attachInterrupt(
    digitalPinToInterrupt(M3_ENCB),
    motor3EncoderISR,
    CHANGE
  );

  configurePWM();

  stopAllMotors();
  resetVelocityController();
  enableMotorDrivers();

  BP32.setup(
    &onConnectedController,
    &onDisconnectedController
  );

