jbriceno225/3-Axis-Holonomic-Drive-Robot/ESP32_Code/Kiwi_Drive_Kin_ROS2_Velocity_PID_Bluepad32.ino
  BP32.enableVirtualDevice(false);

  // Keep commented unless intentionally clearing pairings.
  // BP32.forgetBluetoothKeys();

  Serial.printf(
    "Bluepad32 firmware: %s\n",
    BP32.firmwareVersion()
  );

  Serial.println();
  Serial.println("Pin assignments:");

  Serial.printf(
    "M1: PWM=%u IN1=%u IN2=%u ENCA=%u ENCB=%u\n",
    M1_PWM,
    M1_IN1,
    M1_IN2,
    M1_ENCA,
    M1_ENCB
  );

  Serial.printf(
    "M2: PWM=%u IN1=%u IN2=%u ENCA=%u ENCB=%u\n",
    M2_PWM,
    M2_IN1,
    M2_IN2,
    M2_ENCA,
    M2_ENCB
  );

  Serial.printf(
    "M3: PWM=%u IN1=%u IN2=%u ENCA=%u ENCB=%u\n",
    M3_PWM,
    M3_IN1,
    M3_IN2,
    M3_ENCA,
    M3_ENCB
  );

  Serial.printf(
    "CPR: %.1f | Max target: %.1f RPM | PID: %lu us\n",
    COUNTS_PER_REVOLUTION,
    MAX_TARGET_RPM,
    PID_PERIOD_US
  );

  Serial.println();
  Serial.println("Controls:");
  Serial.println("Left stick: translate");
  Serial.println("Right stick X: rotate");
  Serial.println("A button: emergency stop");
  Serial.println("B button: clear emergency stop");
  Serial.println("Start (misc 0x04): toggle MANUAL / AUTO");
  Serial.println("Serial: MODE,AUTO | MODE,MANUAL");
  Serial.println("Serial: V,x,y,rotation | STOP | PING");
  Serial.println();
  Serial.println("Waiting for Bluetooth controller...");
}





// ---------------------------------------------------------------------------------------------------------------------------
// Main loop
// ---------------------------------------------------------------------------------------------------------------------------

void loop() {
  BP32.update();

  // USB commands from Raspberry Pi / ROS 2.
  processSerialCommands();

  // Keep controller buttons active in both modes.
  processControllers();

  // Safety watchdog for AUTO mode.
  checkAutonomousTimeout();

  // Per-wheel velocity PID at 50 Hz.
  runVelocityPID();

  // Send wheel RPM + encoder counts for ROS odometry.
  sendOdometryTelemetry();

  delay(1);
}
